character_mapping = {
  (0, 5): "Готовка",
  (6, 10): "Путешествия",
  (11, 15): "Рисование",
}

questions = [
    {
        "question": "Вопрос 1: Какое увлечение тебе ближе всего?",
        "options": {
            1: {"text": "Фотография", "points": 3},
            2: {"text": "Готовка", "points": 2},
            3: {"text": "Путешествия", "points": 1},
            4: {"text": "Рисование", "points": 0}
        }
    },
    {
        "question": "Вопрос 2: Какую музыку ты предпочитаешь?",
        "options": {
            1: {"text": "Рок", "points": 3},
            2: {"text": "Поп", "points": 2},
            3: {"text": "Джаз", "points": 1},
            4: {"text": "Классика", "points": 0}
        }
    },
    {
        "question": "Вопрос 3: Какое место ты бы посетил в свободное время?",
        "options": {
            1: {"text": "Галерея искусств", "points": 3},
            2: {"text": "Горы", "points": 2},
            3: {"text": "Театр", "points": 1},
            4: {"text": "Пляж", "points": 0}
        }
    },
    {
        "question": "Какой вид спорта тебе интересен?",
        "options": {
            1: {"text": "Футбол", "points": 3},
            2: {"text": "Теннис", "points": 2},
            3: {"text": "Бег", "points": 1},
            4: {"text": "Йога", "points": 0}
        }
    },
    {
        "question": "Какой цвет ты чаще всего выбираешь в одежде?",
        "options": {
            1: {"text": "Черный", "points": 3},
            2: {"text": "Яркий", "points": 2},
            3: {"text": "Нейтральный (белый, серый)", "points": 1},
            4: {"text": "Пастельный", "points": 0}
        }
    }
]


start_massage = "Привет, добро пожаловать в бот анкету про хобби! чтобы начать нажмите команду /quiz"
info_message1 = "Чтобы начать анкету заново нажмите /quiz"
info_message2 = "Необходимо ввести ответ из предложенных"
warning_message = "Я еще не умею реагировать на текстовые сообщение, отправте доступную команду"

images_info = {
        "Готовка": 'media/cooking.jpg',
        "Путешествия": 'media/traveling.jpg',
        "Рисование": 'media/drawing.jpg'
        }
